// Задача 21. Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними
// в 2D пространстве.
// A (3,6); B (2,1) -> 5,09
// A (7,-5); B (1,-1) -> 7,21

System.Console.WriteLine(Math.Pow(12, 2)); // возведение в степень
System.Console.WriteLine(Math.Sqrt(144)); // вычисление квадратного корня
System.Console.WriteLine(Math.Round(12.123123213, 4)); //округление числа