// Задача 17. Напишите программу, к-рая принимает на вход координаты точки (X,Y), 
// причём X не равен 0 и Y не равен 0 и выдаёт номер четверти плоскости, в к-рой находится эта точка.

Console.Write("Введите координату X: ");
int x = Convert.ToInt32(Console.ReadLine);